scripts/result-analysis/20260422_051015/mvc-cpu-10-run2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: cpu-bound-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 20 complete and 0 interrupted iterations
default   [   0% ] 01/10 VUs  0m01.0s/4m00.0s

running (0m02.0s), 01/10 VUs, 41 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m02.0s/4m00.0s

running (0m03.0s), 01/10 VUs, 62 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m03.0s/4m00.0s

running (0m04.0s), 02/10 VUs, 91 complete and 0 interrupted iterations
default   [   2% ] 02/10 VUs  0m04.0s/4m00.0s

running (0m05.0s), 02/10 VUs, 126 complete and 0 interrupted iterations
default   [   2% ] 02/10 VUs  0m05.0s/4m00.0s

running (0m06.0s), 02/10 VUs, 166 complete and 0 interrupted iterations
default   [   2% ] 02/10 VUs  0m06.0s/4m00.0s

running (0m07.0s), 03/10 VUs, 204 complete and 0 interrupted iterations
default   [   3% ] 03/10 VUs  0m07.0s/4m00.0s

running (0m08.0s), 03/10 VUs, 246 complete and 0 interrupted iterations
default   [   3% ] 03/10 VUs  0m08.0s/4m00.0s

running (0m09.0s), 03/10 VUs, 288 complete and 0 interrupted iterations
default   [   4% ] 03/10 VUs  0m09.0s/4m00.0s

running (0m10.0s), 03/10 VUs, 329 complete and 0 interrupted iterations
default   [   4% ] 03/10 VUs  0m10.0s/4m00.0s

running (0m11.0s), 04/10 VUs, 370 complete and 0 interrupted iterations
default   [   5% ] 04/10 VUs  0m11.0s/4m00.0s

running (0m12.0s), 04/10 VUs, 412 complete and 0 interrupted iterations
default   [   5% ] 04/10 VUs  0m12.0s/4m00.0s

running (0m13.0s), 04/10 VUs, 453 complete and 0 interrupted iterations
default   [   5% ] 04/10 VUs  0m13.0s/4m00.0s

running (0m14.0s), 05/10 VUs, 494 complete and 0 interrupted iterations
default   [   6% ] 05/10 VUs  0m14.0s/4m00.0s

running (0m15.0s), 05/10 VUs, 535 complete and 0 interrupted iterations
default   [   6% ] 05/10 VUs  0m15.0s/4m00.0s

running (0m16.0s), 05/10 VUs, 578 complete and 0 interrupted iterations
default   [   7% ] 05/10 VUs  0m16.0s/4m00.0s

running (0m17.0s), 06/10 VUs, 618 complete and 0 interrupted iterations
default   [   7% ] 06/10 VUs  0m17.0s/4m00.0s

running (0m18.0s), 06/10 VUs, 659 complete and 0 interrupted iterations
default   [   7% ] 06/10 VUs  0m18.0s/4m00.0s

running (0m19.0s), 06/10 VUs, 701 complete and 0 interrupted iterations
default   [   8% ] 06/10 VUs  0m19.0s/4m00.0s

running (0m20.0s), 06/10 VUs, 743 complete and 0 interrupted iterations
default   [   8% ] 06/10 VUs  0m20.0s/4m00.0s

running (0m21.0s), 07/10 VUs, 783 complete and 0 interrupted iterations
default   [   9% ] 07/10 VUs  0m21.0s/4m00.0s

running (0m22.0s), 07/10 VUs, 825 complete and 0 interrupted iterations
default   [   9% ] 07/10 VUs  0m22.0s/4m00.0s

running (0m23.0s), 07/10 VUs, 866 complete and 0 interrupted iterations
default   [  10% ] 07/10 VUs  0m23.0s/4m00.0s

running (0m24.0s), 08/10 VUs, 908 complete and 0 interrupted iterations
default   [  10% ] 08/10 VUs  0m24.0s/4m00.0s

running (0m25.0s), 08/10 VUs, 949 complete and 0 interrupted iterations
default   [  10% ] 08/10 VUs  0m25.0s/4m00.0s

running (0m26.0s), 08/10 VUs, 990 complete and 0 interrupted iterations
default   [  11% ] 08/10 VUs  0m26.0s/4m00.0s

running (0m27.0s), 09/10 VUs, 1032 complete and 0 interrupted iterations
default   [  11% ] 09/10 VUs  0m27.0s/4m00.0s

running (0m28.0s), 09/10 VUs, 1072 complete and 0 interrupted iterations
default   [  12% ] 09/10 VUs  0m28.0s/4m00.0s

running (0m29.0s), 09/10 VUs, 1113 complete and 0 interrupted iterations
default   [  12% ] 09/10 VUs  0m29.0s/4m00.0s

running (0m30.0s), 09/10 VUs, 1155 complete and 0 interrupted iterations
default   [  12% ] 09/10 VUs  0m30.0s/4m00.0s

running (0m31.0s), 10/10 VUs, 1196 complete and 0 interrupted iterations
default   [  13% ] 10/10 VUs  0m31.0s/4m00.0s

running (0m32.0s), 10/10 VUs, 1238 complete and 0 interrupted iterations
default   [  13% ] 10/10 VUs  0m32.0s/4m00.0s

running (0m33.0s), 10/10 VUs, 1279 complete and 0 interrupted iterations
default   [  14% ] 10/10 VUs  0m33.0s/4m00.0s

running (0m34.0s), 10/10 VUs, 1319 complete and 0 interrupted iterations
default   [  14% ] 10/10 VUs  0m34.0s/4m00.0s

running (0m35.0s), 10/10 VUs, 1361 complete and 0 interrupted iterations
default   [  15% ] 10/10 VUs  0m35.0s/4m00.0s

running (0m36.0s), 10/10 VUs, 1403 complete and 0 interrupted iterations
default   [  15% ] 10/10 VUs  0m36.0s/4m00.0s

running (0m37.0s), 10/10 VUs, 1443 complete and 0 interrupted iterations
default   [  15% ] 10/10 VUs  0m37.0s/4m00.0s

running (0m38.0s), 10/10 VUs, 1486 complete and 0 interrupted iterations
default   [  16% ] 10/10 VUs  0m38.0s/4m00.0s

running (0m39.0s), 10/10 VUs, 1529 complete and 0 interrupted iterations
default   [  16% ] 10/10 VUs  0m39.0s/4m00.0s

running (0m40.0s), 10/10 VUs, 1570 complete and 0 interrupted iterations
default   [  17% ] 10/10 VUs  0m40.0s/4m00.0s

running (0m41.0s), 10/10 VUs, 1611 complete and 0 interrupted iterations
default   [  17% ] 10/10 VUs  0m41.0s/4m00.0s

running (0m42.0s), 10/10 VUs, 1651 complete and 0 interrupted iterations
default   [  17% ] 10/10 VUs  0m42.0s/4m00.0s

running (0m43.0s), 10/10 VUs, 1693 complete and 0 interrupted iterations
default   [  18% ] 10/10 VUs  0m43.0s/4m00.0s

running (0m44.0s), 10/10 VUs, 1734 complete and 0 interrupted iterations
default   [  18% ] 10/10 VUs  0m44.0s/4m00.0s

running (0m45.0s), 10/10 VUs, 1776 complete and 0 interrupted iterations
default   [  19% ] 10/10 VUs  0m45.0s/4m00.0s

running (0m46.0s), 10/10 VUs, 1819 complete and 0 interrupted iterations
default   [  19% ] 10/10 VUs  0m46.0s/4m00.0s

running (0m47.0s), 10/10 VUs, 1859 complete and 0 interrupted iterations
default   [  20% ] 10/10 VUs  0m47.0s/4m00.0s

running (0m48.0s), 10/10 VUs, 1901 complete and 0 interrupted iterations
default   [  20% ] 10/10 VUs  0m48.0s/4m00.0s

running (0m49.0s), 10/10 VUs, 1942 complete and 0 interrupted iterations
default   [  20% ] 10/10 VUs  0m49.0s/4m00.0s

running (0m50.0s), 10/10 VUs, 1983 complete and 0 interrupted iterations
default   [  21% ] 10/10 VUs  0m50.0s/4m00.0s

running (0m51.0s), 10/10 VUs, 2024 complete and 0 interrupted iterations
default   [  21% ] 10/10 VUs  0m51.0s/4m00.0s

running (0m52.0s), 10/10 VUs, 2066 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  0m52.0s/4m00.0s

running (0m53.0s), 10/10 VUs, 2107 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  0m53.0s/4m00.0s

running (0m54.0s), 10/10 VUs, 2149 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  0m54.0s/4m00.0s

running (0m55.0s), 10/10 VUs, 2191 complete and 0 interrupted iterations
default   [  23% ] 10/10 VUs  0m55.0s/4m00.0s

running (0m56.0s), 10/10 VUs, 2233 complete and 0 interrupted iterations
default   [  23% ] 10/10 VUs  0m56.0s/4m00.0s

running (0m57.0s), 10/10 VUs, 2273 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  0m57.0s/4m00.0s

running (0m58.0s), 10/10 VUs, 2315 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  0m58.0s/4m00.0s

running (0m59.0s), 10/10 VUs, 2356 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  0m59.0s/4m00.0s

running (1m00.0s), 10/10 VUs, 2398 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  1m00.0s/4m00.0s

running (1m01.0s), 10/10 VUs, 2441 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  1m01.0s/4m00.0s

running (1m02.0s), 10/10 VUs, 2480 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  1m02.0s/4m00.0s

running (1m03.0s), 10/10 VUs, 2521 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  1m03.0s/4m00.0s

running (1m04.0s), 10/10 VUs, 2563 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m04.0s/4m00.0s

running (1m05.0s), 10/10 VUs, 2605 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m05.0s/4m00.0s

running (1m06.0s), 10/10 VUs, 2648 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m06.0s/4m00.0s

running (1m07.0s), 10/10 VUs, 2688 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  1m07.0s/4m00.0s

running (1m08.0s), 10/10 VUs, 2730 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  1m08.0s/4m00.0s

running (1m09.0s), 10/10 VUs, 2771 complete and 0 interrupted iterations
default   [  29% ] 10/10 VUs  1m09.0s/4m00.0s

running (1m10.0s), 10/10 VUs, 2812 complete and 0 interrupted iterations
default   [  29% ] 10/10 VUs  1m10.0s/4m00.0s

running (1m11.0s), 10/10 VUs, 2854 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m11.0s/4m00.0s

running (1m12.0s), 10/10 VUs, 2895 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m12.0s/4m00.0s

running (1m13.0s), 10/10 VUs, 2936 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m13.0s/4m00.0s

running (1m14.0s), 10/10 VUs, 2978 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  1m14.0s/4m00.0s

running (1m15.0s), 10/10 VUs, 3019 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  1m15.0s/4m00.0s

running (1m16.0s), 10/10 VUs, 3060 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m16.0s/4m00.0s

running (1m17.0s), 10/10 VUs, 3103 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m17.0s/4m00.0s

running (1m18.0s), 10/10 VUs, 3144 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m18.0s/4m00.0s

running (1m19.0s), 10/10 VUs, 3184 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  1m19.0s/4m00.0s

running (1m20.0s), 10/10 VUs, 3225 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  1m20.0s/4m00.0s

running (1m21.0s), 10/10 VUs, 3268 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  1m21.0s/4m00.0s

running (1m22.0s), 10/10 VUs, 3309 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  1m22.0s/4m00.0s

running (1m23.0s), 10/10 VUs, 3351 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m23.0s/4m00.0s

running (1m24.0s), 10/10 VUs, 3391 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m24.0s/4m00.0s

running (1m25.0s), 10/10 VUs, 3433 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m25.0s/4m00.0s

running (1m26.0s), 10/10 VUs, 3475 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  1m26.0s/4m00.0s

running (1m27.0s), 10/10 VUs, 3516 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  1m27.0s/4m00.0s

running (1m28.0s), 10/10 VUs, 3557 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m28.0s/4m00.0s

running (1m29.0s), 10/10 VUs, 3600 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m29.0s/4m00.0s

running (1m30.0s), 10/10 VUs, 3641 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m30.0s/4m00.0s

running (1m31.0s), 10/10 VUs, 3681 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  1m31.0s/4m00.0s

running (1m32.0s), 10/10 VUs, 3724 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  1m32.0s/4m00.0s

running (1m33.0s), 10/10 VUs, 3764 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  1m33.0s/4m00.0s

running (1m34.0s), 10/10 VUs, 3806 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  1m34.0s/4m00.0s

running (1m35.0s), 10/10 VUs, 3847 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  1m35.0s/4m00.0s

running (1m36.0s), 10/10 VUs, 3887 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  1m36.0s/4m00.0s

running (1m37.0s), 10/10 VUs, 3931 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  1m37.0s/4m00.0s

running (1m38.0s), 10/10 VUs, 3972 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  1m38.0s/4m00.0s

running (1m39.0s), 10/10 VUs, 4013 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  1m39.0s/4m00.0s

running (1m40.0s), 10/10 VUs, 4056 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  1m40.0s/4m00.0s

running (1m41.0s), 10/10 VUs, 4095 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  1m41.0s/4m00.0s

running (1m42.0s), 10/10 VUs, 4137 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  1m42.0s/4m00.0s

running (1m43.0s), 10/10 VUs, 4180 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  1m43.0s/4m00.0s

running (1m44.0s), 10/10 VUs, 4220 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  1m44.0s/4m00.0s

running (1m45.0s), 10/10 VUs, 4262 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  1m45.0s/4m00.0s

running (1m46.0s), 10/10 VUs, 4302 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  1m46.0s/4m00.0s

running (1m47.0s), 10/10 VUs, 4344 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  1m47.0s/4m00.0s

running (1m48.0s), 10/10 VUs, 4384 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  1m48.0s/4m00.0s

running (1m49.0s), 10/10 VUs, 4428 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  1m49.0s/4m00.0s

running (1m50.0s), 10/10 VUs, 4469 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  1m50.0s/4m00.0s

running (1m51.0s), 10/10 VUs, 4510 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  1m51.0s/4m00.0s

running (1m52.0s), 10/10 VUs, 4551 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  1m52.0s/4m00.0s

running (1m53.0s), 10/10 VUs, 4592 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  1m53.0s/4m00.0s

running (1m54.0s), 10/10 VUs, 4635 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  1m54.0s/4m00.0s

running (1m55.0s), 10/10 VUs, 4677 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  1m55.0s/4m00.0s

running (1m56.0s), 10/10 VUs, 4719 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  1m56.0s/4m00.0s

running (1m57.0s), 10/10 VUs, 4760 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  1m57.0s/4m00.0s

running (1m58.0s), 10/10 VUs, 4800 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  1m58.0s/4m00.0s

running (1m59.0s), 10/10 VUs, 4842 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  1m59.0s/4m00.0s

running (2m00.0s), 10/10 VUs, 4883 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  2m00.0s/4m00.0s

running (2m01.0s), 10/10 VUs, 4925 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  2m01.0s/4m00.0s

running (2m02.0s), 10/10 VUs, 4966 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  2m02.0s/4m00.0s

running (2m03.0s), 10/10 VUs, 5009 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  2m03.0s/4m00.0s

running (2m04.0s), 10/10 VUs, 5050 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m04.0s/4m00.0s

running (2m05.0s), 10/10 VUs, 5092 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m05.0s/4m00.0s

running (2m06.0s), 10/10 VUs, 5132 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m06.0s/4m00.0s

running (2m07.0s), 10/10 VUs, 5172 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  2m07.0s/4m00.0s

running (2m08.0s), 10/10 VUs, 5214 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  2m08.0s/4m00.0s

running (2m09.0s), 10/10 VUs, 5257 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  2m09.0s/4m00.0s

running (2m10.0s), 10/10 VUs, 5299 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  2m10.0s/4m00.0s

running (2m11.0s), 10/10 VUs, 5339 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m11.0s/4m00.0s

running (2m12.0s), 10/10 VUs, 5378 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m12.0s/4m00.0s

running (2m13.0s), 10/10 VUs, 5421 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m13.0s/4m00.0s

running (2m14.0s), 10/10 VUs, 5460 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  2m14.0s/4m00.0s

running (2m15.0s), 10/10 VUs, 5502 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  2m15.0s/4m00.0s

running (2m16.0s), 10/10 VUs, 5544 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m16.0s/4m00.0s

running (2m17.0s), 10/10 VUs, 5586 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m17.0s/4m00.0s

running (2m18.0s), 10/10 VUs, 5627 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m18.0s/4m00.0s

running (2m19.0s), 10/10 VUs, 5668 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  2m19.0s/4m00.0s

running (2m20.0s), 10/10 VUs, 5710 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  2m20.0s/4m00.0s

running (2m21.0s), 10/10 VUs, 5752 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  2m21.0s/4m00.0s

running (2m22.0s), 10/10 VUs, 5792 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  2m22.0s/4m00.0s

running (2m23.0s), 10/10 VUs, 5833 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  2m23.0s/4m00.0s

running (2m24.0s), 10/10 VUs, 5876 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  2m24.0s/4m00.0s

running (2m25.0s), 10/10 VUs, 5917 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  2m25.0s/4m00.0s

running (2m26.0s), 10/10 VUs, 5959 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  2m26.0s/4m00.0s

running (2m27.0s), 10/10 VUs, 6000 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  2m27.0s/4m00.0s

running (2m28.0s), 10/10 VUs, 6040 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  2m28.0s/4m00.0s

running (2m29.0s), 10/10 VUs, 6082 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  2m29.0s/4m00.0s

running (2m30.0s), 10/10 VUs, 6123 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  2m30.0s/4m00.0s

running (2m31.0s), 10/10 VUs, 6166 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  2m31.0s/4m00.0s

running (2m32.0s), 10/10 VUs, 6207 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  2m32.0s/4m00.0s

running (2m33.0s), 10/10 VUs, 6248 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  2m33.0s/4m00.0s

running (2m34.0s), 10/10 VUs, 6289 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  2m34.0s/4m00.0s

running (2m35.0s), 10/10 VUs, 6329 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  2m35.0s/4m00.0s

running (2m36.0s), 10/10 VUs, 6372 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  2m36.0s/4m00.0s

running (2m37.0s), 10/10 VUs, 6412 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  2m37.0s/4m00.0s

running (2m38.0s), 10/10 VUs, 6453 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  2m38.0s/4m00.0s

running (2m39.0s), 10/10 VUs, 6497 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  2m39.0s/4m00.0s

running (2m40.0s), 10/10 VUs, 6537 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  2m40.0s/4m00.0s

running (2m41.0s), 10/10 VUs, 6580 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  2m41.0s/4m00.0s

running (2m42.0s), 10/10 VUs, 6620 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  2m42.0s/4m00.0s

running (2m43.0s), 10/10 VUs, 6662 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  2m43.0s/4m00.0s

running (2m44.0s), 10/10 VUs, 6703 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  2m44.0s/4m00.0s

running (2m45.0s), 10/10 VUs, 6746 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  2m45.0s/4m00.0s

running (2m46.0s), 10/10 VUs, 6786 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  2m46.0s/4m00.0s

running (2m47.0s), 10/10 VUs, 6827 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  2m47.0s/4m00.0s

running (2m48.0s), 10/10 VUs, 6870 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  2m48.0s/4m00.0s

running (2m49.0s), 10/10 VUs, 6911 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  2m49.0s/4m00.0s

running (2m50.0s), 10/10 VUs, 6953 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  2m50.0s/4m00.0s

running (2m51.0s), 10/10 VUs, 6994 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  2m51.0s/4m00.0s

running (2m52.0s), 10/10 VUs, 7034 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  2m52.0s/4m00.0s

running (2m53.0s), 10/10 VUs, 7077 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  2m53.0s/4m00.0s

running (2m54.0s), 10/10 VUs, 7119 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  2m54.0s/4m00.0s

running (2m55.0s), 10/10 VUs, 7158 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  2m55.0s/4m00.0s

running (2m56.0s), 10/10 VUs, 7201 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  2m56.0s/4m00.0s

running (2m57.0s), 10/10 VUs, 7244 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  2m57.0s/4m00.0s

running (2m58.0s), 10/10 VUs, 7282 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  2m58.0s/4m00.0s

running (2m59.0s), 10/10 VUs, 7323 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  2m59.0s/4m00.0s

running (3m00.0s), 10/10 VUs, 7364 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  3m00.0s/4m00.0s

running (3m01.0s), 10/10 VUs, 7409 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  3m01.0s/4m00.0s

running (3m02.0s), 10/10 VUs, 7449 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  3m02.0s/4m00.0s

running (3m03.0s), 10/10 VUs, 7491 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  3m03.0s/4m00.0s

running (3m04.0s), 10/10 VUs, 7533 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m04.0s/4m00.0s

running (3m05.0s), 10/10 VUs, 7573 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m05.0s/4m00.0s

running (3m06.0s), 10/10 VUs, 7613 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m06.0s/4m00.0s

running (3m07.0s), 10/10 VUs, 7656 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  3m07.0s/4m00.0s

running (3m08.0s), 10/10 VUs, 7698 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  3m08.0s/4m00.0s

running (3m09.0s), 10/10 VUs, 7739 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  3m09.0s/4m00.0s

running (3m10.0s), 10/10 VUs, 7779 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  3m10.0s/4m00.0s

running (3m11.0s), 10/10 VUs, 7821 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  3m11.0s/4m00.0s

running (3m12.0s), 10/10 VUs, 7863 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  3m12.0s/4m00.0s

running (3m13.0s), 10/10 VUs, 7904 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  3m13.0s/4m00.0s

running (3m14.0s), 10/10 VUs, 7944 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  3m14.0s/4m00.0s

running (3m15.0s), 10/10 VUs, 7987 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  3m15.0s/4m00.0s

running (3m16.0s), 10/10 VUs, 8030 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  3m16.0s/4m00.0s

running (3m17.0s), 10/10 VUs, 8070 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  3m17.0s/4m00.0s

running (3m18.0s), 10/10 VUs, 8113 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  3m18.0s/4m00.0s

running (3m19.0s), 10/10 VUs, 8153 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  3m19.0s/4m00.0s

running (3m20.0s), 10/10 VUs, 8194 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  3m20.0s/4m00.0s

running (3m21.0s), 10/10 VUs, 8236 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  3m21.0s/4m00.0s

running (3m22.0s), 10/10 VUs, 8277 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  3m22.0s/4m00.0s

running (3m23.0s), 10/10 VUs, 8317 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  3m23.0s/4m00.0s

running (3m24.0s), 10/10 VUs, 8362 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  3m24.0s/4m00.0s

running (3m25.0s), 10/10 VUs, 8401 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  3m25.0s/4m00.0s

running (3m26.0s), 10/10 VUs, 8443 complete and 0 interrupted iterations
default   [  86% ] 10/10 VUs  3m26.0s/4m00.0s

running (3m27.0s), 10/10 VUs, 8485 complete and 0 interrupted iterations
default   [  86% ] 10/10 VUs  3m27.0s/4m00.0s

running (3m28.0s), 10/10 VUs, 8525 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  3m28.0s/4m00.0s

running (3m29.0s), 10/10 VUs, 8567 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  3m29.0s/4m00.0s

running (3m30.0s), 10/10 VUs, 8609 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  3m30.0s/4m00.0s

running (3m31.0s), 10/10 VUs, 8652 complete and 0 interrupted iterations
default   [  88% ] 10/10 VUs  3m31.0s/4m00.0s

running (3m32.0s), 10/10 VUs, 8690 complete and 0 interrupted iterations
default   [  88% ] 10/10 VUs  3m32.0s/4m00.0s

running (3m33.0s), 10/10 VUs, 8734 complete and 0 interrupted iterations
default   [  89% ] 10/10 VUs  3m33.0s/4m00.0s

running (3m34.0s), 09/10 VUs, 8775 complete and 0 interrupted iterations
default   [  89% ] 09/10 VUs  3m34.0s/4m00.0s

running (3m35.0s), 09/10 VUs, 8816 complete and 0 interrupted iterations
default   [  90% ] 09/10 VUs  3m35.0s/4m00.0s

running (3m36.0s), 09/10 VUs, 8857 complete and 0 interrupted iterations
default   [  90% ] 09/10 VUs  3m36.0s/4m00.0s

running (3m37.0s), 08/10 VUs, 8900 complete and 0 interrupted iterations
default   [  90% ] 08/10 VUs  3m37.0s/4m00.0s

running (3m38.0s), 08/10 VUs, 8942 complete and 0 interrupted iterations
default   [  91% ] 08/10 VUs  3m38.0s/4m00.0s

running (3m39.0s), 08/10 VUs, 8982 complete and 0 interrupted iterations
default   [  91% ] 08/10 VUs  3m39.0s/4m00.0s

running (3m40.0s), 07/10 VUs, 9025 complete and 0 interrupted iterations
default   [  92% ] 07/10 VUs  3m40.0s/4m00.0s

running (3m41.0s), 07/10 VUs, 9065 complete and 0 interrupted iterations
default   [  92% ] 07/10 VUs  3m41.0s/4m00.0s

running (3m42.0s), 07/10 VUs, 9106 complete and 0 interrupted iterations
default   [  92% ] 07/10 VUs  3m42.0s/4m00.0s

running (3m43.0s), 06/10 VUs, 9150 complete and 0 interrupted iterations
default   [  93% ] 06/10 VUs  3m43.0s/4m00.0s

running (3m44.0s), 06/10 VUs, 9190 complete and 0 interrupted iterations
default   [  93% ] 06/10 VUs  3m44.0s/4m00.0s

running (3m45.0s), 06/10 VUs, 9232 complete and 0 interrupted iterations
default   [  94% ] 06/10 VUs  3m45.0s/4m00.0s

running (3m46.0s), 05/10 VUs, 9273 complete and 0 interrupted iterations
default   [  94% ] 05/10 VUs  3m46.0s/4m00.0s

running (3m47.0s), 05/10 VUs, 9315 complete and 0 interrupted iterations
default   [  95% ] 05/10 VUs  3m47.0s/4m00.0s

running (3m48.0s), 05/10 VUs, 9357 complete and 0 interrupted iterations
default   [  95% ] 05/10 VUs  3m48.0s/4m00.0s

running (3m49.0s), 04/10 VUs, 9399 complete and 0 interrupted iterations
default   [  95% ] 04/10 VUs  3m49.0s/4m00.0s

running (3m50.0s), 04/10 VUs, 9439 complete and 0 interrupted iterations
default   [  96% ] 04/10 VUs  3m50.0s/4m00.0s

running (3m51.0s), 04/10 VUs, 9481 complete and 0 interrupted iterations
default   [  96% ] 04/10 VUs  3m51.0s/4m00.0s

running (3m52.0s), 03/10 VUs, 9524 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  3m52.0s/4m00.0s

running (3m53.0s), 03/10 VUs, 9566 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  3m53.0s/4m00.0s

running (3m54.0s), 03/10 VUs, 9607 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  3m54.0s/4m00.0s

running (3m55.0s), 02/10 VUs, 9643 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  3m55.0s/4m00.0s

running (3m56.0s), 02/10 VUs, 9683 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  3m56.0s/4m00.0s

running (3m57.0s), 02/10 VUs, 9723 complete and 0 interrupted iterations
default   [  99% ] 02/10 VUs  3m57.0s/4m00.0s

running (3m58.0s), 01/10 VUs, 9745 complete and 0 interrupted iterations
default   [  99% ] 01/10 VUs  3m58.0s/4m00.0s

running (3m59.0s), 01/10 VUs, 9766 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  3m59.0s/4m00.0s

running (4m00.0s), 01/10 VUs, 9787 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  4m00.0s/4m00.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<5000' p(95)=296.27ms
    ✓ 'p(99)<10000' p(99)=318.02ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 39152   163.124944/s
    checks_succeeded...: 100.00% 39152 out of 39152
    checks_failed......: 0.00%   0 out of 39152

    ✓ status is 200
    ✓ content-type is json
    ✓ workloadType is CPU-BOUND
    ✓ executionTimeMs exists

    CUSTOM
    response_time_ms...............: min=46.398572 avg=215.954347 med=232.122618 max=365.189921 p(90)=283.479689 p(95)=296.277174 p(99)=318.025716
    successful_requests............: 9788   40.781236/s

    HTTP
    http_req_duration..............: min=46.39ms   avg=215.95ms   med=232.12ms   max=365.18ms   p(90)=283.47ms   p(95)=296.27ms   p(99)=318.02ms  
      { expected_response:true }...: min=46.39ms   avg=215.95ms   med=232.12ms   max=365.18ms   p(90)=283.47ms   p(95)=296.27ms   p(99)=318.02ms  
    http_req_failed................: 0.00%  0 out of 9788
    http_reqs......................: 9788   40.781236/s

    EXECUTION
    iteration_duration.............: min=46.57ms   avg=216.13ms   med=232.3ms    max=365.36ms   p(90)=283.64ms   p(95)=296.45ms   p(99)=318.2ms   
    iterations.....................: 9788   40.781236/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 2.8 MB 12 kB/s
    data_sent......................: 783 kB 3.3 kB/s



running (4m00.0s), 00/10 VUs, 9788 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  4m0s